import augmentationImage from '../assets/images/Augmentation.jpg'
import consultationImage from '../assets/images/2consult.png'
import preparationImage from '../assets/images/preparation.jpg'
import surgeryImage from '../assets/images/surgery.jpg'
import surgeryImage1 from '../assets/images/surgeriImage1.png'
import surgeryImage2 from '../assets/images/surgeriImage2.jpg'
import rehabilitationImage from '../assets/images/reabilitacion.jpg'
import resultsImage from '../assets/images/results.jpg'
import abdominoplastyImage from '../assets/images/bodi1.jpg'
import implants from '../assets/images/implanti.jpg'
import oper from '../assets/images/oper.jpeg'
import myAbdomImage from '../assets/images/myabdomin2.jpg'
import abdomConsult from '../assets/images/abdomino4.jpg'
import laborator from '../assets/images/laborator.jpg'
import reabilAbdomin from '../assets/images/abdomino5.jpg'

const operationsData = {
  operations: [
    {
      title: 'Augmentation',
      description:
        'Операція по збільшенню грудей. підходить жінкам, які мають  помітні вікові зміни молочних залоз, або ж володіють маленьким або великим  об’ємом грудей. Збільшуюча маммопластика рекомендована жінкам з вродженим недорозвиненням грудей, а також в тих випадках, коли молочні залози зазнали змін в результаті великої втрати ваги. Повернути красиву форму грудей можливо після пологів та грудного вигодовування.',
      shortDescription:
        'Повернути красиву форму грудей можливо після пологів та грудного вигодовування.',
      image: augmentationImage,

      consultation: {
        title: 'Консультація по збільшенню грудей',
        details: `
          <ul>
            <li> Консультація хірурга: огляд, анамнез, підбір імплантів, пояснення процедури. </li>
            <li> Проведення лабораторних аналізів та додаткових обстежень. </li>
            <li> Консультації інших фахівців — терапевта, анестезіолога. </li>
          </ul>
          Покази до операції абдомінопластика

          
          <ul>
            <li> Надлишок жиру в області живота, що не піддається корекції дієтами, вправами або нехірургічними методами корекції.</li>
            <li>  Опущення черевної стінки (птоз)  через різке схуднення або після пологів.</li>
            <li> розтяжки (стрії) на шкірі  в ділянці живота також як результат швидкого зменшиння маси тіла та під час вагітності.</li>
            <li> Розходження прямих м'язів живота , що у своє чергу приводить  до утворення гриж  та опущення внутрішніх органів;</li>            
            <li> Грубі післяопераційні рубці, сильно знижують естетичні дані живота.</li>
            <li> </li>
            <li> </li>
            
          </ul>
          Протипоказаннями до проведення цієї операції є:
          <ul>
            <li> захворювання крові.</li>
            <li> вік менше вісімнадцяти років</li>
            <li> поточна вагітність</li>
            <li> при проблемах зі згортанням крові – гемофілії;</li>
            <li> неконтрольваний цекровий діабет</li>
            <li> загострення  хронічних  захворювань та їх декомпенсація</li>
            <li> під час гострих вірусних та бактеріальних інфекцій;</li>
            <li> гнойнічкові захворювання шкіри</li>
            <li> невеліковні онкологічні  захворювання. </li>
            <li> психічні розлади.</li>
          </ul>

        `,
        image: consultationImage,
      },

      preparation: {
        title: 'Підготовка до операції',
        steps: [
          'Пройдіть медичне обстеження',
          'Здайте аналізи',
          'УЗД молочних залоз, R-графія, ЕКГ...',
          '',
          'Лабораторне дослідження крові',
          '- загальний морфологічний аналіз крові',
          '- загальний аналіз сечі',
          '- коагулограма',
          '- цукор крові',
          '- сечовина і креатинин',
          '- білірубін, АЛТ, АСТ',
          '- група крові і Rh-належність',
          '- RW, HBsAg',
        ],
        image: preparationImage,
      },

      surgery: {
        title: 'Процес операції',
        description: `
Операція триває 2-3 години під загальним наркозом.
          Методи проведення операції:
        Аксілярний (пахвовий).
          Доступ до грудей здійснюється через надріз у пахвових западинах, тканини молочних залоз за такого методу операції не зачіпаються.
        Параареолярний.
          Доступ до грудей через ареоли сосків, при цьому косметичний післяопераційний рубець залишається практично непомітним, часто такий метод застосовується в поєднанні з круговою підтяжкою грудей.
        Субмаммарний. 
          Найбезпечніший метод, доступ до тканин здійснюється через розріз під грудьми в природній складці.
      
          Способи встановлення імплантату:
        Під молочну залозу. 
          Використовується вкрай рідко, встановлення імплантату можливе тільки за наявності достатнього обсягу м’яких тканин і малого розміру грудей.
        Під грудний м’яз у двох площинах.
          Верхня частина імплантатів опиняється під грудним м’язом, а нижня — під залозистою тканиною, що забезпечує надійний захист від промацування і зміщення.
        Під фасцію великого грудного м’яза 
          Цей спосіб забезпечує додаткову фіксацію протезу завдяки зрощенню з грудним м’язом.

        `,
        image: [surgeryImage, surgeryImage1, surgeryImage2],
      },

      rehabilitation: {
        title: 'Реабілітація після операції',
        steps: [
          'Важливим етапом після корекції, збільшення грудей є період реабілітації. Після операції слід чітко дотримуватись рекомендацій лікаря.',
          'перші 7 днів відмовитись від будь-яких фізичних навантажень;',
          'носити спеціальну компресійну білизну (не менше 2-х місяців);',
          'біля 2-х місяців після операції не займатись фізичними вправами, зменшити навантаження на тіло;',
          '',
          'Носіння компресійної білизни',
          'Уникнення фізичних навантажень...',
          'відмовитись від професійних тренувань, планування вагітності на період від 6 місяців після мамопластики.',
        ],
        image: rehabilitationImage,
      },

      results: {
        title: 'Результати операції',
        description:
          'Мамопластика – це можливість для жінок назавжди позбутися комплексів. Після пластики грудей пацієнтка набуває психологічний комфорт та впевненість у сексуальній привабливості. Пластична операція грудей дозволяє пацієнтці навіть після хірургічного лікування онкології відчути себе жінкою.',
        image: resultsImage,
      },

      implants: {
        title: 'Імпланти для пластики грудей',
        description:
          'Мамопластика – це можливість для жінок назавжди позбутися комплексів. Після пластики грудей пацієнтка набуває психологічний комфорт та впевненість у сексуальній привабливості. Пластична операція грудей дозволяє пацієнтці навіть після хірургічного лікування онкології відчути себе жінкою.',
        image: implants,
      },
    },

    {
      title: 'Abdominoplasty',
      description: `"Абдомінопластика" - 'це сучасний метод пластичної операції', суть якого полягає в усуненні обвислої шкіри та жирових відкладень із передньої черевної стінки живота методом їх відсічення і подальшої підтяжки. 
      'Також проведення абдомінопластики' за потреби може передбачати реконструкцію м’язового корсета, якщо відбулося розтягнення прямих м’язів живота після пологів. 

      Проведення абдомінопластики  можливе двох типів: 
      
      повна абдомінопластика – передбачає видалення значної площі шкірного покриву живота із ділянки від лобкової кістки і до лінії пупка. Решту шкіри натягують і пришивають над лобком. Відповідно пупок дещо зміщується.
      мініабдомінопластика – метод, який не передбачає зміщення пупка. Відрізняється від повної абдомінопластики тим, що відсікається менший за площею шматок шкіри живота, відповідно верхній край відрізаної шкіри розташований нижче від рівня пояса. 
      Пластика живота – це безпечний та ефективний спосіб позбутися обвислої шкіри після сильного схуднення навіть на 50 і 100 кг. За допомогою абдомінопластики можна без дієт і спортивних залів підтягнути живіт і позбутися значних жирових відкладень.`,

      shortDescription: 'Пластика живота для створення стрункішого тіла.',

      image: abdominoplastyImage,

      consultation: {
        title: 'Консультація по абдомінопластиці',
        details: `
          <ul>
            <li>Огляд і консультація з хірургом.</li>
            <li>Планування операції з обговорення  очікуваних результатів  операції та  ризики можливих ускладнень.</li>
            <li>Проведення необхідних аналізів та інструментальних обстежень.</li>            
          </ul>

                    Покази до операції абдомінопластика
          <ul>
            <li> Надлишок жиру в області живота, що не піддається корекції дієтами, вправами або нехірургічними методами корекції.</li>
            <li>  Опущення черевної стінки (птоз)  через різке схуднення або після пологів.</li>
            <li> розтяжки (стрії) на шкірі  в ділянці живота також як результат попереднього набору маси тіла та під час вагітності.</li>
            <li> Розходження прямих м'язів живота , що у своє чергу приводить  до утворення гриж  та опущення внутрішніх органів;</li>            
            <li> Грубі післяопераційні рубці, сильно знижують естетичні дані живота.</li>
          
          </ul>
                    Протипоказаннями до проведення цієї операції є:
          <ul>
            <li> захворювання крові.</li>
            <li> вік менше вісімнадцяти років.</li>
            <li> поточна вагітність та годування груддю.</li>
            <li> неконтрольваний цекровий діабет.</li>
            <li> декомпенсовані хронічні захворювання.</li>
            <li> невеліковні онкологічні  захворювання. </li>
            <li> гнойнічкові захворювання шкіри.</li>
            <li> психічні розлади.</li>
          </ul>
        `,
        image: abdomConsult,
      },

      preparation: {
        title: 'Підготовка до операції',
        steps: [
          'Лабораторне дослідження крові',
          '- загальний морфологічний аналіз крові',
          '- загальний аналіз сечі',
          '- коагулограма',
          '- цукор крові',
          '- сечовина і креатинин',
          '- білірубін, АЛТ, АСТ',
          '- група крові і Rh-належність',
          '- RW, HBsAg',
          'Консультації з фахівцями.',
          'Підготовка тіла до операції.',
        ],
        image: laborator,
      },

      surgery: {
        title: 'Процес операції',
        description: `
          "Мініабдомінопластика" -
          Багато пацієнтів 'помилково' вважають, що 'мініабдомінопластика' –це скорочений варіант традиційної пластики живота. Наприклад, через менший доступ або менш помітний рубець. Однак це не зовсім так. При 'мініабдомінопластиці', як і за 'стандартної операції', розріз виконується в надлобковій зоні. І оскільки він розташовується по лінії бікіні, то надалі добре маскується спідньою білизною. А 'ключовою відмінністю мініабдомінопластики від повної операції' є те, "що корекція проводиться лише у нижньому відділі черевної стінки". Тобто від пупка до лобка і не передбачає переміщення пупка.

          "Повна (класична) пластика живота" -
          
          виконується в тих випадках, коли необхідна 'максимальна корекція передньої черевної стінки' (від рівня грудної клітини до лобкової зони). Також для отримання кращого результату повну абдомінопластику часто поєднують з ліпосакцією лобкової зони, бедер та спини. При проведенні повної пластики живота пластичний хірург виконує розріз відповідно до попередьо нанесеної розмітки, відшаровує шкіру, одночасно переносячи в нове положення пупок і укріплюючи мязи передньої черевної стінки. Після цього відсікається відвислий шкірний лоскут та надлишкова жирова тканина. На завершальному етапі виконується накладання косметичних швів. Досить 'часто в процесі операції хірург укріплює білу лінію передньої черевної стінки з усуненням гриж'.


        `,
        image: [oper, myAbdomImage],
      },

      rehabilitation: {
        title: 'Реабілітація після операції',
        steps: [
          'Протягом одного-двох днів після хірургічних маніпуляцій пацієнт повинен перебувати у стаціонарі під постійним наглядом.',
          'Знаходитись в ліжку постійно в напівсидячому положенні;',
          'Пити можна лише воду, їсти не дозволяється.',
          'На другу добу дозволяється прийом їжі в невеликих кількостях, дозволяється вставати з ліжка.',

          'Весь місяць слід носити компресійну білизну у вигляді бандажа для для швидкого відновлення та профілактики набряклості.',
          'Не можна мочити область швів перші 5-7 днів.',
          'Також протягом місяця потрібно обробляти шви антисептичними засобами, які порадить лікар.',
        ],
        image: reabilAbdomin,
      },

      results: {
        title: 'Результати операції',
        description: `
        Результатом абдоминопластики стане більш підтягнутий і красивий живіт і скоригована фігура. Але щоб утримати результати необхідно буде дотримуватися здорового харчування і займатися спортом. В іншому випадку при підвищенні маси тіла шкіра знову може розтягнутися.


        `,

        image: resultsImage,
      },
    },

    // інші операції
  ],
}

export default operationsData
